[
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "Tall Men Next Door",
    "puzzleBody": " Next door  to  me  live  four  brothers   of  different heights.  Their  average  height  is 74 inches,  and  the difference in height amongst the first three men is two inches. The difference between  the third and the fourth man is six inches.\nCan you tell how  tall is each brother?",
    "puzzleSolution": "The first brother  is 70 inches tall, the second  72, the third 74 and the fourth brother 80 inches tall.",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "A Matter of  Time",
    "puzzleBody": " fifty   minutes ago if it was four times as many minutes  . past  three   o'clock,   how  many  minutes  is it to  six o'clock?",
    "puzzleSolution": " Twenty-six minutes ",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "Brothers and Sisters ",
    "puzzleBody": "A family I  know has several children. Each boy in this family has as many sisters as brothers but each girl has twice as many brothers as sisters.\nHow many brothers  and sisters are there",
    "puzzleSolution": "Since the boys have as many brothers  as sisters, there must be 1  boy more than the number  of girls. If we try 2 and 1, 3 and 2, and 4 and 3, we will find that 4 boys and 3 girls is the solution to fulfil the requirement  that each girl has twice as many brothers  as sisters",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "Around the Equator ",
    "puzzleBody": " Two identical  trains, at the  equator  start travelling round the world in opposite  directions. They start together.  run at the same speed  and  are on different tracks.\nWhich train will wear out its wheel treads first?",
    "puzzleSolution": " Naturally, the  train travelling against  the  spin  of the earth. This train will wear out its wheels more quickly,because the centrifugal force is less on this train",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "Over the Golden Gate ",
    "puzzleBody": " While      in San  Francisco some  time back,  I  hired a car to drive over the Golden  Gate bridge.  I started in the  afternoon  when  there  was  no  traffic rush.  So  I could  drive  at  a  speed  of 40  miles an  hour.  While returning. however.  I got caught in the traffic rush and I  could only manage  to drive at a speed  of 25 miles an hour.\nWhat was my average  speed  for the round tnp?",
    "puzzleSolution": " No, the answer is not 321/2    miles an hour, though this figure is the obvious answer! However. this represents the average of the 2 speeds and not the average speed for the whole trip.\nIf the time is equal  to the distance  divided by the average speed,  then the time for the trip starting from San Francisco equals 5/40   and the time for the return trip  is 5/2s    which   gives  us  a total  time  of 5140 +  s12:,,which equals   135/200.Therefore,  the  average  speed    for  the  whole   trip when   the  average  speed   equals   the  distance   divided by  the  time  is 25  divided   by LlS/200  which  equals  2S times   200/135,    which   equals   4005/us          or  30   1011, miles  an  hour.",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "The Digits and the square  Numbers",
    "puzzleBody": " Au the  nine  digits are arranged  here  so as· to form four square  numbers:9,        81,        324,        576 \nHow would you put them together  so as to form a single smallest  possible  square  number  and  a single largest possible square  number?",
    "puzzleSolution": " The  lowest   square   number  I    can  think  of.  containing \nall the  nine  digits  once  and  only  once.   is  1398S4276. the  square   of  11826, and  the  high'est  square   number under  the  same  conditions   is 923187456  the square  of 30384.",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "Bicycle Thieves ",
    "puzzleBody": " A friend of mine runs a bicycle shop and he narrated to me this following story:A man. who looked like a tourist, came to his shop one  day and  bought  a bicycle from him for Rs. 350.The cost price of the bicycle was Rs. 300. So my friend was happy that he had made  a profit of Rs. 50 on the sale. However, atthe time of settling the bill, the tourist offered to pay m travellers cheques  as he had no cash money  with  him.  Mu friend  hesitated.   He  had  no arrangement    with  the   b..:mks   to   encash   travellers cheques.   But  he  remembered   that  the  shopkeeper next  door  has such  a provision,  and  so he took  the cheques to his friend next door and got cash from him.The travellers cheques were all of Rs. 100 each and so he had taken four cheques  from the tourist totalling to Rs  400.  On encashing  them  my friend paid back the tourist the balance  of Rs. 50 The tourist happily climbed the bicycle and pedall•ed away whistling a tune.\nHowever, the next morning my friend's neighbour, who  had  taken  the  travellers  cheques   to  the  bank,called on  him and  returned  the  cheques  which  had proved  valueless  and  demanded the  refund  of  his money.  My friend quietly refunded  the money  to his neighbour  and tried to trace the tourist who had given him the worthless cheques  and taken away his bicycle. But the tourist could not be found.How  much  did my friend  lose  altogether  in this unfortunate transaction?",
    "puzzleSolution": " One   can -think  of  different   answers   tor  this  question. but  yet  the  correct   answer   is very  simple   All we have to  consider    is  that   the   shop   owner   could   not  have possibly  lost  more  than  the  iourist  actually  stole The  tourist  got away  with the bicycle  which cost the shop   owner   Rs.  300   and   the  Rs.  50  'change   .      and therefore, he  made   off  with  Rs   350.   And  this  is  the exact  amount   of the  shopkeeper's   loss.",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "The Bus Number ",
    "puzzleBody": " While    visiting a small town  in the United States.  ! lost my overcoat  in a bus. When I  reported  the matter to the bus company  I  was asked the number of the bus Though  I   did not remember  the  exact number  I      did remember  that the bus number  had a certain peculia rity about it. The number plate showed the bus number was a perfect square  and also if the plate was turned upside  down,  the  number   would  still be  a  perfect square-v-of course it was not'?\nI came  to know  from the bus company  they had only five hundred  buses numbered from 1    to 500 From this I  was able to deduce  the bus number Can you tell what was the number?",
    "puzzleSolution": " By experiment  we  find that  the  only  numbers   that can be  turned   upside   down  and  still read  as a number   are 0, 1,  6, 8 and  9.",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "The Hour Hand and The Minute Hand ",
    "puzzleBody": "We all know  that  the  hour  hand  and  the  minute hand  on a clock travel at different speeds.  However there  are  certain  occasions  when  they  are  exactlv opposite  each  other.  Can you give a simple torrnula for calculating the times of these occasions",
    "puzzleSolution": "Here is the formula that gives the minutes past twelve to which the hour hand points when the minute hand is exactly thirty minutes ahead.Minutes past twelve Yv ef  [ (n-1)  2+1] where n is the next hour-Let's take the case of at what time between  4 and  5 will the hands be opposite  each other?  (n=5).:?ox 9 =270+   2d.<iTI          TI          ·11\"i.e. the hour hand will be 24-fi_minutes past 4.The formula may be derived from the following:If X is distance moved by the minute hand Y is the distance moved by hour hand then X-Y = 30 First time the hands move round X =   12 Y Second time the hands move round  X =  12 Y-5 Third time the hands move round  X = 12 Y-10  etc",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "To catch a Thief ",
    "puzzleBody": "Some time back while in England  I   came  across a case in a criminal court. A man was being accused  of having stolen certain valuable jewels and trying to run away with them, when he was caught by a smart police officer who overtook  him.In cross examination  the lawyer for accused  asked the  police  officer how  he  could  catch  up  with the accused who was already twenty seven steps ahead  of him, when  he started  to run after him.  'Yes  sir,' the officer replied. 'He takes eight steps to every five of mine.' 'But  then  officer'.  interrogated   the  lawyer,  'how did you ever catch him, if that was the case?''That's  easily explained  sir,' replied  the  officer. · 1 have got a longer stride ... two stepsof  mine are equal to his five. So  the  number  of steps  I   required  were fewer than his, and this brought  me to the spot where I  captured  him.'A member  of the jury, who was particularly good at quick calculations  did some  checking  and  figured out the number  of steps the police officer must have taken.\nCan you also find out how many steps the officer needed  to catch up with the thief?",
    "puzzleSolution": "The Police Officer took thirty steps.  In the same time the thief took forty-eight, which added  to his start of twenty-seven,  that means  he took seventy-hve  steps This distance would be exactly equal to thirty steps of the Police Officer",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "The Gong",
    "puzzleBody": " Supposing   a clock takes 7 seconds  to strike 7  how long will the same clock take to strike 1 O?",
    "puzzleSolution": " While  striking 7 the  clock strikes its first gong  at 7 o'clock and it strikes 6 more at regular intervals. These 6 intervals take 7 seconds so that the intervals between gongs is  7 16 seconds.  However, to strike 10 there are 9 intervals each taking  7         seconds for a total of 101 seconds.",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "Something for the Marmalade ",
    "puzzleBody": " A little girl I  know sells oranges  trom door to door.One  day  while  on  her  rounds  she  sold  1           an orange  more  than  halt  her  oranges  to the  first   custamer. To the second  customer she sold 1;' an orange more than  half of the remainder  and to the third and the last customer she sold 1         2 an orange more than half she now had, leaving her none.\nCan you tell the number  of oranges  she originally had? Oh. by the way, she never had to cut an orange",
    "puzzleSolution": " In order that the little girl should have disposed of the oranges  she had remaining after her second  sale, she must have had at least one whole orange remaining so that she could deduct from it 'half of her oranges plus half an orange', for the third and the final sale. There• fore, if  1  orange  represents  half of the remaining after the second  sale, then she must have sold two oranges in her second  sale, leaving the 3 oranges after the first sale.\nLastly,if three oranges only represent  half the orig• inal number,  plus half an orange  ,   then she must have started with ((3 x 2) + 1]  or 7 oranges.",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "The Counterfeit Note",
    "puzzleBody": "While walking down the street one morning I found a hundred rupee note on the footpath.I picked it up,noted the number and took it home.In the afternoon the plumber called on me to collect his bill.As I had no other money at home,I settled his account with the hundred rupee note I had foun.Later I came to know that the plumber paid the note to his milkman to settle his monthly account,who paid it to his tailor for the garments he had made.The tailor in tum used the money to buy an old sewing machine,from a woman who lives in my neighbourhood.This woman incidentally,had borrowed hundredrupees from me sometime back to buy a pressure cooker,remembering that she owed me hundred rupees,came and paid the debt.I recognised the note as the one I had found on the footpath,and on careful examination I discovered that the bill was counterfeit.\nHow much was lost in the whole transaction and by whom?",
    "puzzleSolution": "All the transactions carried out through the counterfeit note  are  invalid and therefore, everybody  stands in relation  to his debtor  just where  he was before  I  picked up the  note",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "Cotton or Gold",
    "puzzleBody": " Which   would you say is heavier, a pound  of cotton or a pound  of gold?",
    "puzzleSolution": " A  pound  of cotton  is  heavier  than  a pound  of gold because cotton is weighed by the avoirdupois  pound,which consists of 16 ounces,  whereas  gold,  being  a precious metal is  weighed  by the  troy pound  which contains 12 ounces (5760 grams).",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "Nuts for Nuts ",
    "puzzleBody": " Last   time I  visited a friend's farm near Bangalore  he gave me a bag containing  1000 peanuts   From this   l took  out 230  peanuts  for myself and  gave away the bag  with  the  remainder   of  peanuts   to  three   little brothers who live in my neighbourhood   and told them to distribute the nuts  among,  themselves in proportion to  their  aqes=-which   together   amounted   to  J  7 1 years.Tinku, Rinku and Jojo, the three brothers. Divided the nuts in the following manner:As often as Tinku took four Rinku took three and as often as Tinku took six Jojo took seven With this data  can  you  find out  what  were  the respective  ages of the boys and how manv  nuts each got?",
    "puzzleSolution": " When Tinku takes 12, Rinku and Jojo will take 9 and 14, respectively-and  then  they  would  have  taken altogether thirty-five nuts.Thirty-five is contained  in 770  twenty-two  times which means all one has to do now is merely multiply 12, 9 and 14 by 22 to find that Tinku's share was 264,Rinku's 198 and Jojo's  308.Now as the total of their ages is 17112  years or half the sum of 12, 9 and 14, their respective ages must be 6, 4,12   and 7 years.",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "The Wedding Anniversary",
    "puzzleBody": " Recently   l attended  the twelfth wedding anniversary celebrations  of my good  friends Mohini and  Jayant. Beaming  with pride  Jayant   looked  at  his wife and commented,  'At the time when we got married Mohini was 3/4th of my age, but now she is only 5/6th:We  began  to  wonder  how  old  the  couple  must have been  at the time of their marriage!Can you figure it out?",
    "puzzleSolution": " Jayant was 24 and Mohini 18",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "I’ ll Get it for you Wholesale… ",
    "puzzleBody": " A wholesale  merchant   came  to  me  one  day  and posed  this problem.  Every day in his business he had to weigh amounts  from one  pound  to one  hundred and twenty-one  pounds,  to the nearest  pound.  To do this, what is the minimum number  of weights he needs and how heavy should each weight be?",
    "puzzleSolution": " The minimum number  of weights required  is five and these should weigh 1, 3, 9, 27 and 81 pounds.",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "The Broken Glasses ",
    "puzzleBody": " My    friend Asha was throwing a very grand party and wanted to borrow from me 100 wine glasses. I  decided to-send  them  through  my boy servant,Harish.Just  to give an incentive  to Harish to deliver the glasses  intact  I   offered  him 3  paise  for every  glass delivered safely and threatened  to forefeit 9 paise for every glass he broke.On settlement  Harish received  Rs. 2.40 from me How many glasses did Harish break?",
    "puzzleSolution": " Let's  assume  G  is  the  number  of glasses  delivered intact. Then,3G = the amount  earned.Let's assume B is the number  of glasses broken Then,\n9B = the amount  forfeited\n3G -  9B =   240\n9B = --240\nG + B =    100\n3B = 300\n128 = 60\nB =  5 and G =  95",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "The Peculiar Number ",
    "puzzleBody": "There is a number which is very peculiar.This number is three times the sum of its digits \nCan you find the number?",
    "puzzleSolution": " The number  is 27, 2 + 7 =   9,            9 x 3 =27",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "Make a Century",
    "puzzleBody": " There  are eleven different ways of writing 100 in the form of mixed numbers  using all the nine digits once and only once. Ten of the ways have two figures in the integral part of the  number,  but the  eleventh  expression has only one figure there.Can you find all the eleven expressions?",
    "puzzleSolution": "81(5643/297),81(7524/396)..etc",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "The Perplexed  Postal clerk ",
    "puzzleBody": " My friend Shuba  works in a post office and she sells stamps.  One  day a man  walked  in and  kept seventy five paise on the counter  and requested,  'Please  give me  some  2 paise  stamps,  six times as many  as one paisa stamps, and for the rest of the amount  give me 5 paise stamps.'The bewildered  Shuba thought for a few moments and finally she handed  over the exact fulfilment of the order to the man-with  a smile.\nHow would you have handled  the situation?",
    "puzzleSolution": " I don't know about you, but I would have handed over 5 two paise  stamps,  30  one  paisa · stamps  and 7 five paise stamps.",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "The Mystery of the Missing Paisa ",
    "puzzleBody": " Two women   were  selling  marbles  in  the  market place-one   at three for a paisa and other at two for a paisa. One  day both  of them  were  obliged  to return home when each had thirty marbles unsold. Thcv put together  the  two  lots of marbles  and  handing  them over to a friend asked  her to sell them  at five tor ,! paise. According to their calculation. after all. 3 for on« paisa and 2 for one paisa was exactly the same as \"1 for 2 paise. Now they were  expecting  to get 25 parse  for the marbles, as they would have got. if sold separately  But much to their surprise  they got only 24 parse for the entire lot Now where did the one paisa go') Can you explain the mystery?",
    "puzzleSolution": " There isn't really any mystery, because the explanation is simple. While the two ways of selling are only identical, when the number of marbles sold at three for a paisa and two for a paisa is in the proportion  of three to two. Therefore, if the first woman  had handed  over 36 marbles and  the  second  woman  24,  they  would have fetched  24  paise,  immaterial  of, whether  sold separately or at five for 2 paise.  But if they  had  the same number of marbles which led to loss of 1  paisa when sold together, in every 60 marbles.So, if they had 60 each, there would be a loss of 2 paise and if there were 90 each (180 altogether) they would lose 3 paise and so on.In the case of 60, the missing 1   paisa  arises from the fact that the 3 marbles  per paisa  woman  gains 2 paise and the 2 marbles per paisa woman loses 3 paise.The first woman receives 9112  paise and the second woman 14112,so  that each loses 112  paise in the trans•Action.",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "Walking back to Happiness",
    "puzzleBody": " A man  I   know,  who  lives in my neighbourhood, travels to Chinsura   everyday   for his work.  His wife drives him over to Howrah Station every morning and in the evening exactly at 6 p .m .She picks him up from the station and takes him home.One day he was let off at work an hour earlier, and so he arrived at the Howrah  Station at 5 p.m. instead of at 6 p .m. He started walking home. However,he  met his wife enroute  to the  station  and  got into the  car: They  drove  home  arriving  10  minutes  earlier  than usual.How long did the man have to walk, before he was picked up by his wife?",
    "puzzleSolution": " The  couple  arrived  home   10  minutes  earlier  than usual. Therefore,the point at which they met must have been 5 minutes driving time from the station. Thus,the wife should have been  at that point at five minutes to six. Since the man started  to walk at five o'clock,  he must have been  walking for 55 minutes when he rriet his wife.",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "On the line ",
    "puzzleBody": " ft is a small town  railway station  and  there  are  25 stations  on  that  line. At each  of the  25  stations  the passengers   can  get  tickets  for any  of  the  other  24 stations.\nHow many  different kinds of tickets do you think the booking  clerk has to keep?",
    "puzzleSolution": " At each station passengers can get tickets for any of the other  24 stations and,therefore,  the number of  tickets required is 25 x 24 =   600.",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "The Legacy",
    "puzzleBody": " When    my uncle in Madura died recently. he left d will, instructing his executors  to divide his estate oi R~.1,920,000  in this manner:  Every son  should  receive three  times  as  much  as  a daughter,  and  that  every daughter should get twice as much as their mother\nWhat is my aunt's  share?",
    "puzzleSolution": " My aunt's share was Rs.  49200(10/13)",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "The Round Table ",
    "puzzleBody": " We have  a circular dining  table  made  of marble which had come down to us as a family heirloom. We also have some beautiful bone-china  saucers that I recently brought  from Japan.\nDiameter  of. our  table     top  is fifteen  times  the diameter  of our  saucers  which  are  also circular. We would like to place the saucers on the table so that they neither overlap   each other nor the edge of the table.\nHow many can we place in this manner?",
    "puzzleSolution": "please refer \"puzzle to puzzle you\"book by shakuntala Devi.",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "Down the escalator",
    "puzzleBody": " Recently,   while in London,  I  decided  to walk down the escalator of a tube station. I  did some quick calcu• lation in my mind. I.found that if I walk down twenty-six steps,  I   require  thirty seconds  to  reach  the  bottom. However,  if I  am able to step down thirty-four stairs I would  only  require  eighteen  seconds  to  get  to  the bottom.If the time is measured  from the moment  the top step  begins to descend  to the  time I   step  off the  last step  at  the  bottom,  can  you  tell the  height  of the stairway in steps?",
    "puzzleSolution": "If I  walk 26 steps I  require 30 seconds.If I  walk 34 steps I  require only 18 seconds. Multiplying  30  by  34  and 26 by 18 we get 1020 and 468.The difference between 1020 and 468 is 552. When we divide this number by the difference between 30  and  18,  i.e.  by  12  we  get  the  answer  46-the number of steps in the stairway",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "The Chess Board",
    "puzzleBody": " We all know that a chess board has 64 squares.  This can be completely  covered  by 32 cardboard  rectang• les, each cardboard  covering just 2 squares.Supposing  we remove 2 squares of the chess board at diagonally opposite  corners, can we cover the modi• fied board  with 31 rectangles?  If it can be done.  how can  we  do  it? And  if  it  cannot  be  done,   prove  11 impossible.",
    "puzzleSolution": " No  It cannot be done.Each  rectangle covers one white square  and  one black square, because on a chess board the white and black squares are always adjacent.The two squares which we remove  from the chess board are of the same  colour,  and  so the  remaining board  has  two  more  boxes  of one  colour  than  the other. And after the rectangles have covered 60 boxes, there  will be  left two  squares  of  the  same  colour.",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "The Game of Cats and Mice",
    "puzzleBody": " A number  of cats got together  and  decided  to kill between  them 999919  mice. Every cat killed an equal number of mice.\nHow many cats do you think there were'>Oh, by the way let me clarify Just two points    It is not one  cat killed the  lot, because  I   have said 'Cats· and  it is  not  999919   cats  each  killed one  mouse. because  I  have used the word 'mice·I  can give you just one clue---each  cat killed more mice than there were cats.",
    "puzzleSolution": " Just  one  look at the number 999919   and  we know that it cannot   be  a prime   number.   And  if the  problem   has to  have   only  one  answer.   this  number  can  have  only two  factors.   The   factors   are  991   and   1009.   both  of which  are  primes.We know  that  each  cat killed more  mice  than  there were  cats,  and.therefore.the   correct  answer.   clearly.  is that  991  cats  killed  1009  mice.",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "The Wheels",
    "puzzleBody": " A friend of mine in Bangalore  owns a horse-driven carriage.  It  was  found  that  the  fore  wheels  of  the carriage  make  four  more  revolutions  than  the  hind wheel in going 96 feet. However, it was also found that if the circumference  of the fore wheel was 3/ 2 as great and of the hind wheel 4/3 as great, then the fore wheel would make only 2 revolutions rnore than hind wheel in going the same distance of 96 feet.\nCan you find the circumference  of each wheel'?",
    "puzzleSolution": " The  forewheel   is 8 feet  in circumference    and  the  hind wheel   12 feet",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "Blow Hot  Blow cold ",
    "puzzleBody": " ft   is a matter of common  knowlcdqe  that 0°C is the same as 32°F. It is also a known fact that l00°C  equals 212°F. But there is a temperature  that gives the same reading on both Centigrade  and Fahrenheit  scales.\nCan you find this temperature?",
    "puzzleSolution": " IfX is the temperature  ~=X     -    32\ni.e.~=          -32\nwhich  gives  X =    -40\ni.e.  -40°C =   -40°F.",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "Animals on the farm",
    "puzzleBody": " My    friend who owns a farm near Bangalore had five droves  of  animals  on  'his farm  consisting  of  cows sheep  and  pigs with the same  number  of animals in each drove.\nOne day he decided to sell them all and sold them to eight dealers.\nEach of the eight dealers bought the same number of animals and paid at the rate of Rs. 17 for each cow Rs. 2 for each sheep  and Rs. 2 for each pig\nMy friend received from the dealers in total Rs 28')How  many  animals  in all did he  have  and  how many of each kind')",
    "puzzleSolution": " We know  that there  were  five droves  with an equal number in each drove, and,therefore,the  number must be  divisible by 5. As every  one  of the  eight dealers bought the same number of animals, the number must also be divisible by 8. This leads us to the conclusion that the number must be a multiple of 40 Now  the  highest   possible   multiple   of 40  that  will work is 120,  and  this number   could  be made  up in one of two ways-1     cow,  23 sheep   and  96 pigs or 3 cows, 8  sheep   and   109  pigs.   But  the   first  does   not   fit in because   the  animals   consisted   of  'Cows.   Sheep   and Pigs'  and  a single  'Cow'.  is  not  'Cows'.   Therefore,   the second   possibility  is  the  correct   answer.",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "Which is the Better Bargain ?",
    "puzzleBody": " Recently   while shopping  in New Market in Calcutta, I came across two very nice frocks selling at a discount.I   decided to buy one of them for my little girl Mammu.The shopkeeper offered me one  of the frocks for Rs.35 usually selling for 817 of that price and the other one for Rs. 30 usually selling for 716  of that price.Of the two frocks which one do you think is a better bargain and by how much percent?",
    "puzzleSolution": "8hth  of Rs. 35 equals Rs. 40, the regular selling price•of the first frock and 7/sth  of Rs. 30 equals Rs. 35. the regular selling price of the second  frock. Now. if  the first frock usually sells for Rs. 40 and is sold for Rs. 35 on the reduced  price, then I  save Rs. 5. This gives me a gain on the cost the percentage  of S!Js which equals 117  and that is a little more than 14.28.\nThe second frock usually sells for Rs. 35, which on \nthe reduced  price costs me Rs. 30. Again I  save Rs. 5 which equals 5/30  or 1/6   that amounts to, in percentage,a gain of little more  than  16.66.  The  difference  bet• ween the first frock and the second in terms of percen• tage  gained  is a  little more. than  2.38.  Hence, the second frock is a better buy.",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "Walking all the way ",
    "puzzleBody": " One day I  decided  to walk all the way from Bangalore to Tumkur. I started exactly at noon. And someone I    know  in Tumkur  decided   to  walk  all the  way  to Bangalore  from Tumkur  and she started  exactly at 2 P.M., on the same day.We  met  on  the  Bangalore-Tumkur   Road  at five past  four,  and  we  both  reached   our  destination  at cxactlv the same time.\nAt what time did we both arrive?",
    "puzzleSolution": " The key to the solution is that with a little bit of pencil work, it  will be  found,  while I  can walk 5 miles, my friend who started from Tumkur can walk 7 miles. Let's assume the distance between  Bangalore  and Tumkur is  24 miles, then  the  point  of meeting  would  be  14 miles   from   Bangalore.     and,  therefore,   I       walked   3 ; miles  per  hour  while  my friend  walked  44/c,  miles per hour,  and  we both  arrived  exactly  at 7 P M",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "The Trainand  The Cyclist",
    "puzzleBody": " A railway  track  runs  parallel   to  a road  until  a bend brings  the  road  to a level  crossing.  A cyciist rides  along to work  along  the  road  every  day  at a constant   speed of 12 miles  per  hour.He  normally   meets   a train  that  travels  in   the same direction  at the  crossing.One  day  he  was  late  by 25 minutes   and  met  the train  6  miles   ahead    of  the   level  crossing     Can  vou figure out  the  speed   of the  train')",
    "puzzleSolution": " Let's  assume   that the  man  and  the train normally  meet at  the  crossing   at  8  AM ..   then   the  usual  time  of. the cyclist  at the  bend   is  8 AM.  and  he  is  6 miles  behind at 7.30  AM.  But  when  the  cyclist is late.  he arnves  at the  bend   at  8.25   AM.   and   therefore    he  rs   six miles behind   at 7.55  AM.  Since  the  tram  takes  5 mmutcs  to travel   the  six  mile  run.   the  speed   of  the  tram  rs   7'.!. m.p.h.",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "Something for Profit ",
    "puzzleBody": " A friend  of mine  bought   a used  pressure   cooker   for Rs.  60.  She   somehow   did  not  find  it  useful   and   so when  a friend  of hers  offered  her  Rs. 70 she  sold  it to her.  However,   she  felt bad  after  selling  it and  decided to buy  it back  from  her  friend  by offering  her  Rs  80 After having  bought   it once  again  she  felt that  she  did not really need  the cooker.   So she sold it at the auction for Rs. 90.\nHow  much  profit did she make?  Did she at ali make any profit?",
    "puzzleSolution": " The  woman   made  altogether  Rs. 20.  She  made  Rs  10 when   she  sold  the  item  for tbe  first time  and  another Rs.  10 when  she  sold  it for the  second   time",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "The Digital Game ",
    "puzzleBody": " Jhere  is a  number,   the  second   digit of  which  is smaller than its first digit by 4, and if the number was divided by the diqits'sum, the quotient would be 7. Can you find the number?",
    "puzzleSolution": " The  number  is 84.",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "The Faulty Machine",
    "puzzleBody": " A factory manufacturing flywheels for racing cars has ten machines to make them. The manufacturer  knows the correct weight for a flywheel.\nHowever, one day one of the machine   begins to produce   faulty parts--either  overweight   or  under• weight.\nHow can the manufacturer  find the faulty machine in only two weighings?",
    "puzzleSolution": "The  manufacturer   must  take   one   flywheei   made  by each  machine,   find their  total  weight  and  compare  this with  the   weight   of  the   equivalent    number    of  good flywheels   to obtain  the  difference.   Then, he  must take 1   flywheel   from   machine    number  one.   2  flywheels",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "The Dishonest  Merchant ",
    "puzzleBody": " An unscrupulous trader decided to make some extra profit on coffee. He bought one type of coffee powder at Rs. 32 a kilo and  mixed some  of it with a better quality of coffee powder  bought  at Rs. 40 a kilo, and he sold the blend at Rs. 43 a kilo. That gave him a profit of 25 per cent on the cost.\n How many kilos of each kind must he use to make a blend of a hundred  kilos weight?",
    "puzzleSolution": " The merchant must mix 70 Kilos of the Rs. 32 coffee with 30 Kilos of Rs. 40 coffee",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "For the Charities ",
    "puzzleBody": " Q ne day when  I  was walking on the  road in New Delhi, a group  of boys approached me for donation for their poor  boys'  fund. I  gave them  a rupee  more than  half the  money  I  had  in my purse   I   must have walked  a few more  yards  when  a group  of women approached me for donation, for an orphanage.  1   gave them  two rupees  more  than  half the  money  I  had in my purse. Then, after a few yards I was approached by a religious  group  for a donation  to the  temple  they were building. I gave them three rupees more than half of what I  had in my purse.\nAt last when I  returned to my hotel room.  1      found that I  had only one rupee  remaining in my purse.\nHow much money  did I  have in my purse when I started?",
    "puzzleSolution": " I  must  have  had  Rs  42  in my purse  when   I     started",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "The Number Game  ",
    "puzzleBody": " The product  of three  consecutive   numbers  when divided by each of them in turn. the sum of the three quotients  will be 74.\nWhat are the numbers'?",
    "puzzleSolution": "4. 5 and  6.",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "The Sari and The Blouse ",
    "puzzleBody": " J bought a sari and a blouse  for Rs. 110 at the New Market. The sari cost Rs. 100 more  than the blouse, how much does the sari cost?",
    "puzzleSolution": " If the   sari  cost   Rs.   100  and   the   blouse    Rs  10 The difference would  be Rs  90. And therefore the sari must    r cost more  and  the blouse  less. I little thouqhr indicate the  sari  costs   Rs.  105  and   the  blouse   Rs   5  So. the difference in cost  is Rs   100",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "When was he born ",
    "puzzleBody": " Some months back, this year, I was walking through the Central Park in New York.I  saw an intelligent looking little boy playing all by himself on the grass. I  decided  to talk to him and just as an excuse to start the conversation  I  asked him his age. A mischievous  glint flickered in his eyes and he replied, 'Two days back I  was ten years old, and next year I  shall be thirteen. If you know what's todauyou'll be able to figure out my birthday and that'll give you my age.' I  looked at him bewildered.\nHow old was the boy",
    "puzzleSolution": " The  date  on which  I  met  the boy was  1st  January  1977. and  the  boy's   birthday was  on  :31st December.   1965  The  boy  was  11  years  old  on  the  day  I     met  him ",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "The Weight of the Block",
    "puzzleBody": " A cement   block  balances  evenly  on  the  scales  with three  quarters   of a pound  and  three  quarters  of a block. What  is the  weight  of the  whole  block)",
    "puzzleSolution": "The Whole block weighs 3lbs",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "Lucrative Business",
    "puzzleBody": " Two unemployed   young    men   decided    to  start  a business   together.   They  pooled   in their savings,  which came   to  Rs. 2,000_  They  were  both  lucky,  their  busi ness  prospered   and  they  were   able  to  increase   their capital  by 50 per  cent  every  three  years.\nHow   much   did   they   have   in  all  at  the   end   of eighteen  years",
    "puzzleSolution": "They had Rs  22781.25",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "The Old ship ",
    "puzzleBody": " Some  years back  I   was travelling by a cargo  ship from New Zealand  to  Tahiti.  I   was  curious  to  look around the ship one day,and in the boiler room I  asked a man how old the ship was. He smiled and replied in this way: 'The ship is twice as old as its boiler was when the  ship was as  old  as  the  boiler  is  now.  And  the combined age of the ship and the boiler is thirty years.'\nCan you figure out what is the age of the ship and of the boiler?",
    "puzzleSolution": " Let's assume  that the age  of the ship at present  is X years and of the boiler Y years.Then The ship Xis twice-as old as its boiler (Y -  X) was when the ship was (x-X) as old as the boiler is now X =   2  (Y -  X) and (x --  X)  =  2. Eliminating X gives 4Y = 3x. Also. x + Y =  30 \nY (the boiler}= ~1years. and X (the ship)= 1~0years. ",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "The three containers",
    "puzzleBody": " We     have three containers which hold 19, 13 and 7 ounces of liquid respectively. The 19 ounce  container is empty but the 13 and 7 ounces  containers  are full. How can we measure out 10 ounces by using only the three above mentioned  containers?",
    "puzzleSolution": "……",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "On the way to Market",
    "puzzleBody": " One morning  I   was on my way to the market and met a man who had 4 wives. Each of the wives had 4 bags,containing  4 dogs and each dog had 4 puppies Taking  all  things  into  consideration.  how  many were going to the market?",
    "puzzleSolution": " Just  myself'  Only  I  was  going  to the  market  and  I    rnet all the  others  coming   from  the  opposite  direction",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "A Matter of Denominator",
    "puzzleBody": " A fraction  has  the  denominator   greater  than  its numerator  by 6. But if you add 8 to the denominator. the value of the fraction would then become  1 Can you find this fraction'?",
    "puzzleSolution": "The fraction  is 7/13",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "Right Foot Forward",
    "puzzleBody": " A short man takes three  steps  to a tall man's  two steps. They both start out on the left foot. How many steps do they have to take before they are both step• ping out on the right foot together?",
    "puzzleSolution": " They  will never  step  out  with right  foot  together",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "The problem  of socks",
    "puzzleBody": " Mammu   wears socks of two different colours-white and brown. She keeps them all in the same drawer in a state of complete disorder.She has altogether  20 white socks and 20 brown socks in the drawer. Supposing  she has to take out the socks in the dark, how many must she take out to be sure that she has a matching pair?",
    "puzzleSolution": "Mammu    should    take   out   3  socks   from   the   drawer because  if she  takes   out  only  2  then.   both   could  be of different   colours  However the  third  selection   would result  in a pair  of white  or brown  socks",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "A fair division ",
    "puzzleBody": "A rich farmer died leaving behind  a hundred  acres of his farm to be divided among  his three  daughters Rashmi,   Mala  and   Rekha-- in  the   proportion   of one-third,  one-fourth  and  one-fifth, respectively.  But Rekha died unexpectedly.Now  how  should  the  executor  divide  the  land, between Rashmi and Mala in a fair manner",
    "puzzleSolution": " As Rckha's  share  falls in through  her  death.   the  farm has now  to be divided  only between  Rash rm and Mala. in the  proportion  ot one  third to onc-rourth    that rs m the   proportion   of  four-twelfths    to  three    Therefore. Rashmi    gets  four-sevenths  of the  hundred  deres  and Mala three-sevenths",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "Mathematics and literature",
    "puzzleBody": " Recently   a publishing company  which specialises in mathematical  books, advertised the job opening of an assistant editor. The response was good. One hundred people  applied  for the position.  The company,  how• ever,  wanted  to make  their selection  from the applicants who had some training in both mathematics and literature.Out of one hundred applicants the company found that 10 of them had no training in mathematics and no training in literature, 70 of them had got mathematical training and 82 had got training in literature How  many  applicants  had  got  training  in both mathematics  and literature?",
    "puzzleSolution": "Ten applicants had neither mathematics  nor literature training. So.we can now concentrate on the remaining 90 applicants. Of the 90. twenty had got no mathematics training  and eight had got no literary training.That leaves us with a remainder of 62 who have had training in both literature and mathematics",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "Heads I Win Tails I lose",
    "puzzleBody": " During  my last visit to Las Vegas in the U.S.A., I met a man who was an inveterate  gambler.  He took out a coin from his pocket and said to me, 'Heads  I  win.tails I lose.   I'll bet half the money  in my pocket.'He  tossed  the  coin,  lost and  gave  me  half  the money in his pocket.  He repeated the bet again and again each time offering half the money in his pocket.The game  went  on  for quite  some  time.  I   can't recollect exactly how long the game went on or how many times the coin was tossed,  but I   do remember that the number of times he lost was exactly equal to the number of times he won.\nWhat do you think, did he, on the whole,  gain or lose?",
    "puzzleSolution": "The man must have lost. And the longer  he went on the more he would lose-with  simple calculations. ,w can draw this-conclu sron:In two tosses he was left with three quarters of his money.In six tosses with twenty-seven  sixty-fourths of his money, and so on. Immaterial of the order of the wins and losses. he loses money.  so long as their number is in the  end equal",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "Problem from Lilavati",
    "puzzleBody": " Here       is an  ancient   problem  from  Bhaskaracharvas Lilavati:A beautiful maiden. with   beam mg   eye's, c1sk:,   me which   is the   number  that.   multiplied  by  3   then  m creased   by three-fourths  of the  product   divided  by 7. diminished  by one-third  of the  quotient.  multiplied  by itself,  diminished  by  52, the  square   root  found.  addi•tion  of 8, division 'by  10 gives  the  number  2?Well,  it sounds   complicated,  doesn't   ?   No, not  if  you  know  how  to go about   it.",
    "puzzleSolution": "28 is the answer.The  method  of  working  out  this problem   is to reverse the whole process-multiplying 2 by 10, deducting 8. squaring the result and so on.",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "Pigs and Ducks",
    "puzzleBody": "While driving through  the  countryside  one  day  I saw a farmer tending his pigs and ducks in his yard. I was curious to  know  how  many  of each  he  had.  I stopped the car and inquired.Leaning  on  the  stile jovially, he  replied,  'I have altogether 60 eyes and 86 feet between  them'.I  drove off trying to calculate in my mind the exact number of ducks and pigs he had.\nWhat do you think is the answer?",
    "puzzleSolution": " There  were  sixty eyes,  so there  must  have  been  thirty animals.    Now   the   question    is  what   combination    of four-legged   pigs and  two-legged   ducks  adding  10.th1n1,, will give  86  feet.  With  some   pencil  work.  we  get the answer   13 pigs  and  17 ducks",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "The Faulty watch",
    "puzzleBody": " Qne day l found  a strange  thing happening  to my watch=-the  minute  hand  and  the  hour  hand  were coming together  every sixty-five minutes. I  decided  to get it checked.\nWas my watch  gaining  or  losing time,  and  how much per hour?",
    "puzzleSolution": " If 65 minutes  be counted on the face of the same  watch then   the  problem   would   be  impossible.    because   the hands   must  coincide   every  69' / 11  minutes   as shown by  its face-and    it  hardly  matters   whether  it  runs  fast or  slow.  However.    if  it  is measured  by  actual  time.  It gains  5I 11  of .a  minute   in  65  minutes   or  60114;-:    of a minute  per  hour.",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "Mathematics and literature",
    "puzzleBody": " Recently   a publishing company  which specialises in mathematical  books, advertised the job opening of an assistant editor. The response was good. One hundred people  applied  for the position.  The company,  how• ever,  wanted  to make  their selection  from the applicants who had some training in both mathematics and literature.\nOut of one hundred applicants the company found that 10 of them had no training in mathematics and no training in literature, 70 of them had got mathematical training and 82 had got training in literature How  many  applicants  had  got  training  in both mathematics  and literature?",
    "puzzleSolution": "Ten applicants had neither mathematics  nor literature training. So.we can now concentrate on the remaining 90 applicants. Of the 90. twenty had got no mathematics training  and eight had got no literary training.That leaves us with a remainder of 62 who have had training in both literature and mathematics",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "The Egg vendor and His Eggs",
    "puzzleBody": " Rasoot,    the  man  who  delivers  eggs  to  my home everyday,  did not turn up one day. So when he came the  next  morning  I   demanded an  explanation  from him. He told me the following story:The  previous  morning  when  he Just came out of the house  carrying a basketful of eggs on his head to start his daily rounds  and stepped on to the street, a car  going  at  full  speed   brushed   against  him  and knocked  down his basket destroying all the eggs. The driver,  however,  a thorough  gentleman  admitted his responsibility  and  offered to compensate   him for da• mages.   But  Rasool  could  not  remember the  exact number of eggs he had, but he estimated the number between 50 and  100.      He was also able to tell the gentleman  that if the eggs were counted  by 2's and Ts at a time, none  would be left, but if counted  by s·s at a time, 3 would remain. and that he sold the eggs 50 paise a piece.The gentleman  made  some  quick calculations and paid Rasool adequately.\nHow much did the gentleman  pay Rasool'?",
    "puzzleSolution": "The  simplest  way is to find those  numbers   between   SO and   100. which  are  multiples   of 2  and  J  leaving  no remainder.    These  numbers   are  54. 60. 66. 7l.. 78. 84.90 and  96. By scrutiny  we find that  if 78 rs  divided  by 5 it will give  15 plus  3  left over.  Therefore,   78  is  the total  number  of eggs  Rasool  had  in his basket.  Belore the  accident.   And,therefore,he     was paid  Rs. 39 by the gentleman",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "Some Luck!",
    "puzzleBody": " A society of farmers who own farms in the vicinity of my home  town  Bangalore,  planned  on holding  a raffle and persuaded  me to buy a ticket. The value of the ticket was Rs. 5. As I did not want to pay the entire amount myself, I asked my friend Radha to chip in with me, and offered to share  with her in 'proportion   the prize bounty-  if there was going to be any. She paid Rs. 2 and I   paid the rest. As luck would have it-Bingo!  .  .  .       we won the first prize-a   flock of 50 sheep! Good God!    .  .  .        Neither of us knew what to do with the sheep   .  .  .         Where would we take them in the first place? Neither of us had had any training as shepherds!  So we decided  to sell the sheep back to the farmers.\nAs per our original understanding  20 of the sheep belonged to Radha and 30 were mine.\nHowever, I  decided that we had won the prize because  of our  combined   luck,  and  so  we  should divide.its value equally.\nThe sheep-30of  mine  and  20  ofRadha's-were sold, each at the same price, and I  paid her Rs. 150 to make the sum equal.\nWhat was the value per sheep?",
    "puzzleSolution": " The  value  per  sheep   was  Rs. 30.",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "The Trains and the Falcon ",
    "puzzleBody": " Two trains  start from two opposite directions  towards each  other.   The  stations   from  which  thev  start  are  SO miles  apart.   Both  the  trains  start at the  same  time  on a single  track.  A falcon  which  is sitting on one  tram. starts at the  same  time  towards   the  other  train.  as soon  as it reaches   the second   one,it  flies back  to the first train and so  on  and  so  forth   It  continues    to  do  so,flying  back wards   and  forwards   from  one  train  to  the  other   until the  trains  meet.Both   the  trains  travel  at  a  speed   of 25  miles  per hour,   and  the  bird  flies at  100  miles  per  hour How  many  miles  will the  falcon  have  flown before the  trains  meet?",
    "puzzleSolution": " The trains travel at 25 miles per hour. Therefore, they will meet .after  travelling for one  hour  and the falcon also must  have  been   flying for one  hour.  Since  it travels at 100 miles per hour, the bird must have flown 100 miles.",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "Which is more Lucrative ?",
    "puzzleBody": "A businessman   advertised   two  job  openings   for peons in his firm. Two men applied  and the business• man decided to engage both of them. He offered them a salary of Rs. 2,000  per year;  Rs. 1,000  to be paid every half year, with a promise that their salary would be raised if their work proved satisfactory. They could have a raise of Rs. 300 per year, or if they preferred, Rs. 100 each half year.The two men thought for a few moments  and then one of them expressed  his wish to take the raise at Rs.300  per  year,  while  the  other  man  said  he  would accept the half yearly increase  of Rs. 100. Between the two men, who was the gainer, and by how much?",
    "puzzleSolution": " At a raise of  Rs 300 per year:\nIsl year Rs.  1000   + Rs.  1000 = Rs.  2000\n2nd year Rs.  1150 + Rs. 1150 =  Rs. 2300\n3rd year Rs. 1300 T   Rs.  1300 = Rs.   2600\n4th year Rs.  1450  + Rs.  1450-=   Rs.   2900\nAt a raise of Rs. 100 each half year· Isty~arRs.1000     + Rs.1100=   Rs. 2100\n2nd year Rs.  1200 + Rs. 1300 ==    Rs. 2.SOO\n3rd year Rs. 1400 + Rs. 1500 =  Rs.  2900\n4th year  Rs.  1600 + Rs. 1700 =  Rs.  3300\nObviously the second  proposition  is much  more lucrative.",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "Little Mammu and the Marbles",
    "puzzleBody": " Little  Mammu  was playing marbles  with her friend Nawal I   heard  her say to him. 'if you give me one of your marbles I'll have as many as you.'  Nawal replied.'if you give me one of your marbles. and I'll have twice as many as you.\nI  wondered  how many marbles each had I   What do you think?",
    "puzzleSolution": " Mammu had 5 marbles and Nawal 7",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "A family Matter ",
    "puzzleBody": " Fifteen    years  back  my neighbour  Mrs  Sareen  had three daughtersSudha,   Seema  and Reerna    and their combined  ages were half of hers. During the next five years Sonny was born and Mrs. Sateen's age equalled the total of all her children· s ages.\n After some years Kishu was born and then Sudha was as old as Reema  and Sonny  together.  And now. the  combined  age  of all the  children  is  double  Mrs. Sareen's age, which is, as a matter of fact  only equal to that of Sudha  and Seema  together.  Sudha's  age rs also equal to that of the two sons.\nWhat is the age of each one of them?",
    "puzzleSolution": "The ages must be as follows:\nMrs Sareen 39\nSudha 21\nSeema 18\nReema 18\nSonny 1\nKishu 9\nIt is obvious that Seema  and Reerna  are twins",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "The curious License Plate ",
    "puzzleBody": " When    I   acquired  my Mercedes-Benz  car  in Ger• many, the first thing I  had to do was to get a license plate. The plate  I   got had a peculiar  number  on it.  It consisted of 5 different numbers  and by mistake when I  fixed it upside down the number  could be still read, but the value had increased  by 78633.\nWhat was my actual license number?",
    "puzzleSolution": " There  are  only 5 numbers  that  can  be  read  upside down=-U, 1. 6. 8 and 9. Now we only have to arrange these numbers so that when turned  upside down the result will be larger by 78633.  With some experiment we will find that the number  is 10968 which is 89601. inverted.",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "Lose or Gain",
    "puzzleBody": " A man  I    know  runs  a  workshop  in Calcutta.  He bought  two lathes to use in his workshop.  However, he  found  out  afterwards  that they  did not serve the purpose   for which  he  had  bought  them,  and  so he decided  to sell them.  He sold them  each for Rs. 600 making a loss of 20'1o on one of them and a profit of 20%  on the other. Did he  lose  or gain  in the  transaction and  how much did each machine  cost him?",
    "puzzleSolution": " He sold one for Rs. 600 losing 20'1., on the transaction. So.he must have paid Rs. 750 for that lathe and since he made 20'10 profit on the  other  machine  he  must have bought it for Rs. 500. Thereforn,his total loss is of Rs. 50",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "A Problem of Combination",
    "puzzleBody": " A box contains  12 marbles of three different colours green,  yellow and blue-~4  each.If you  were  to close your  eyes and  pick them at random,  how many marbles  must you take out to be sure that there  are at least two of one  colour among the marbles picked out?",
    "puzzleSolution": " In the first three pickings you may get 1  of each colour,on the 4th pick there will be at least two of one colour. Therefore.the  answer is 4.",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "On the Sea-Saw",
    "puzzleBody": " Some days back, walking through  the park  I  saw a little girl trying to play the see-saw all by herself. It takes two to see-saw, but here was a girl who was ingenious enough to try and see-saw  on her own.I  saw her tying a number of bricks to one  end  of the plank to balance  her weight at the other.I    curiously noted  that  she  just  balanced against sixteen bricks, when these were fixed to the short end of the plank and  I  also noticed  that if she were to fix them to the long end  of the plank, she  only needed eleven as balance.I  wondered  what was the girl's weight. The brick, I could guess weighed equal to a three quarter brick and three quarter of a pound.\nCan you figure it out?",
    "puzzleSolution": " A brick weighed 3 lbs. Therefore,  16 bricks weighed 48 lbs and 11 bricks 33  lbs. Multiplying 48 by 33 and taking the square root we get 39. 79. The girl's weight must have been about 39.79   lbs.",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "Sawing The Tree Trunk",
    "puzzleBody": "A heavy tree trunk can be sawed  into a  12 ft   long piece in oneminute.  How long will it take to saw it into twelve equal pieces?",
    "puzzleSolution": " Eleven   minutes.  The   twelfth   piece   does   not  require sawing",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "The Split",
    "puzzleBody": " Canyou split 34 parts into two parts such that \".  7  of one of the parts equals 2 Is of the  other?",
    "puzzleSolution": "14 and 20.",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "At The Fete",
    "puzzleBody": " A number  of us went out together  to a chanty fete one day. Our party consisted of 4 different professional groups, namely 25 writers. 20 doctors,  18 dentists and 12 bank employees.  We spent altogether  Rs. 1.330 Later it was found that 5 writers spent as much as four doctors, that twelve doctors spent as much as nine dentists,  and  that six dentists spent  as much as eight bank employees.\nHow much did each of the four professional groups spend?",
    "puzzleSolution": " The writers spent  Rs. 350, the doctors  also spent  Rs.350.   the   dentists   spent   Rs.  420   and   the   bank employees  spent Rs. 210. Thus,they  spent altogether  Rs.  1330.  The  five writers  spent  as  much  as  four doctors. twelve doctors spent as much as nine dentists. and six dentists as much as eight bank employees.",
    "puzzleSource": "puzzle to puzzle"
  },
  {
    "puzzleType": "ShakuntalaDevi",
    "puzzleTitle": "At The Store",
    "puzzleBody": "J entered a store and spent on~-half of the money that was in my purse. When  I·  came out I  found that I   had just as many paise as I  had  rupees  and  half as many rupees asI had paise when I  went in.\nHow much money did I have.    with    me   when   I entered?",
    "puzzleSolution": " I  must have .  entered  the  store  with  Rs. 99. 98 in my purse",
    "puzzleSource": "puzzle to puzzle"
  }
]
